# Taps
tap 'caskroom/cask'

# Binaries
brew 'bash'
brew 'bat'
brew 'curl'
brew 'git'
brew 'gnupg2'
brew 'go'
brew 'grep'
brew 'mas'
brew 'pkg-config'
brew 'tree'
brew 'vim'
brew 'zsh'

# Development
brew 'brew-php-switcher'
brew 'imagemagick'
brew 'mariadb'
brew 'mas'
brew 'nginx'
brew 'n'
brew 'php'
brew 'redis'

# Applications
cask 'alfred'
cask 'docker'
cask 'gpg-suite'
cask 'imageoptim'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'karabiner-elements'
cask 'postman'
cask 'spectacle'
cask 'viscosity'

# Mac App Store Applications
mas 'amphetamine', id: 937984704
mas 'bear', id: 1091189122